books/books-java/books-web-services/soa-aplicado/soa-aplicado-cap-07-2/src/test/resources/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:v1="http://fernando.com.br/server/application/autores/v1">
                  
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		
		<wsa:Action>autores/solicitarRelacaoDeAutores</wsa:Action>
		
		<wsa:MessageID>
			4585ee4b-5e25-4e82-a91f-0f79bb330b6a
		</wsa:MessageID>
		
		<wsa:ReplyTo>
			<wsa:Address>
				http://localhost:8080/soa-aplicado/autoresCallback
			</wsa:Address>
		</wsa:ReplyTo>
	</soapenv:Header>
	
	<soapenv:Body>
		<v1:solicitarRelacaoDeAutores>
			<desde>2012-12-12</desde>
		</v1:solicitarRelacaoDeAutores>
	</soapenv:Body>

</soapenv:Envelope>